reddit/app/models/user.rb

    def self.find_by_credentials(user_name, password)
        user = User.find_by(username: user_name)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "jboos567"], ["LIMIT", 1]]

    def reset_token!
        self.session_token = self.class.generate_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "CbSm99nYbdoF1veipfaxbQ"], ["updated_at", "2019-05-07 15:55:53.768999"], ["id", 5]]