reddit/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "author_id", "post_id", "parent_comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "second comment to please"], ["author_id", 8], ["post_id", 3], ["parent_comment_id", 1], ["created_at", "2019-05-07 21:15:58.714020"], ["updated_at", "2019-05-07 21:15:58.714020"]]
---
    def create
        @comment = Comment.new(comment_params)
        @comment.author_id = current_user.id
        @comment.post_id = params[:comment][:post_id]
        if @comment.save