reddit/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "POst 1"], ["url", "example.com"], ["content", "nice"], ["author_id", 5], ["created_at", "2019-05-07 18:01:28.718273"], ["updated_at", "2019-05-07 18:01:28.718273"]]
---
    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id
        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "url" = $2, "content" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["title", "google t"], ["url", "URL.com"], ["content", "content things"], ["updated_at", "2019-05-07 20:06:26.249791"], ["id", 7]]
---
    def update
        @post = Post.find(params[:id])
        if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def destroy
        @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def ensure_author
        redirect_to subs_url unless current_user.id == Post.find(params[:id]).author_id