reddit/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "Please work x2"], ["updated_at", "2019-05-07 17:48:55.201536"], ["id", 1]]
---
    def update
        @sub = Sub.find(params[:id])
        if @sub.update(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def ensure_moderator
        redirect_to subs_url unless current_user.id == Sub.find(params[:id]).moderator_id