reddit/app/views/posts/new.html.erb

SELECT "subs".* FROM "subs"
---

    <% Sub.all.each do |sub| %>

SELECT  1 AS one FROM "post_subs" WHERE "post_subs"."sub_id" = $1 AND "post_subs"."post_id" IS NULL LIMIT $2  [["sub_id", 1], ["LIMIT", 1]]
---
                    value='<%= sub.id %>'
                    <%= "checked" if @post.sub_ids.include?(sub.id) %>>